jpat-transfer-logs/src/main/resources/openshift/templates/request.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://itau.com.co/services/support/transfertransactionlog/v1/schemas" xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:modTransferTransactionLogRq>
         <sch:HeaderRequest>
            <sch1:MessageHeader>
               <sch1:MessageKey>
                  <sch1:integrationId>$!{headers.integrationId}</sch1:integrationId>
                  <sch1:requestVersion>$!{headers.requestVersion}</sch1:requestVersion>
                  <sch1:requestUUID>$!{headers.requestUUID}</sch1:requestUUID>
               </sch1:MessageKey>
               <sch1:MessageInfo>
                  <sch1:dateTime>$!{headers.dateTime}</sch1:dateTime>
                  <sch1:systemId>$!{headers.systemId}</sch1:systemId>
                  <sch1:originatorName>$!{headers.originatorName}</sch1:originatorName>
                  <sch1:originatorType>$!{headers.originatorType}</sch1:originatorType>
                  <sch1:terminalId>$!{headers.terminalId}</sch1:terminalId>
                  <sch1:terminalType>$!{headers.terminalType}</sch1:terminalType>
                  <sch1:bankIdType>$!{headers.bankIdType}</sch1:bankIdType>
                  <sch1:bankId>$!{headers.bankId}</sch1:bankId>
                  <sch1:trnType>$!{headers.trnType}</sch1:trnType>
               </sch1:MessageInfo>
               <sch1:TrnInfoList>
                  <!--Zero or more repetitions:-->
                  <sch1:TrnInfo>
                     <sch1:trnCode>$!{headers.trnCode}</sch1:trnCode>
                     <sch1:trnSrc>$!{headers.trnSrc}</sch1:trnSrc>
                  </sch1:TrnInfo>
               </sch1:TrnInfoList>
            </sch1:MessageHeader>
            <sch1:User>
               <sch1:userName>$!{headers.userName}</sch1:userName>
               <sch1:userToken/>
               <sch1:employeeIdentlNum>$!{headers.employeeIdentlNum}</sch1:employeeIdentlNum>
            </sch1:User>
         </sch:HeaderRequest>
         #if(${headers.trnDt})
         <sch:trnDt>$!{headers.trnDt}</sch:trnDt>
         #end
         <sch:Trn>
            <sch:trnId>$!{headers.trnId}</sch:trnId>
            <sch:trnType>$!{headers.trnType}</sch:trnType>
            <sch:trnSubType>$!{headers.trnSubType}</sch:trnSubType>
            <sch:trnCode>$!{headers.trnCode}</sch:trnCode>
            <sch:trnCodeRev>$!{headers.trnCodeRev}</sch:trnCodeRev>
            <sch:TrnStatus>
               <sch:trnStatusCode>$!{headers.trnStatusCode}</sch:trnStatusCode>
               <sch:trnStatusDesc>$!{headers.trnStatusDesc}</sch:trnStatusDesc>
               <sch:trnStatusReason>$!{headers.trnStatusReason}</sch:trnStatusReason>
            </sch:TrnStatus>
            #if(${headers.effDt})
            <sch:effDt>$!{headers.effDt}</sch:effDt>
            #end
         </sch:Trn>
         <sch:CustId>
            <sch1:SPName/>
            <sch1:custPermId>$!{headers.custPermId}</sch1:custPermId>
            <sch1:custLoginId/>
            <sch1:custType>$!{headers.custType}</sch1:custType>
         </sch:CustId>
         <sch:BenefitName>
            <sch1:fullName>$!{headers.fullName}</sch1:fullName>
            <sch1:firstName/>
            <sch1:middleName/>
            <sch1:lastName/>
            <sch1:motherMaidenName/>
         </sch:BenefitName>
         <sch:Acct>
            <sch1:acctId>$!{headers.acctId}</sch1:acctId>
            <sch1:acctType>$!{headers.acctType}</sch1:acctType>
            <sch1:acctSubType/>
            <sch1:branchId/>
         </sch:Acct>
         <sch:BankInfo>
            <sch1:bankId>$!{headers.bkInfoBankId}</sch1:bankId>
            <sch1:name>$!{headers.bankName}</sch1:name>
            <sch1:country>$!{headers.bankCountry}</sch1:country>
            <sch1:city>$!{headers.bankCity}</sch1:city>
         </sch:BankInfo>
         <sch:FromPhoneNum>
            <sch1:phoneType/>
            <sch1:phone>$!{headers.fromPhone}</sch1:phone>
         </sch:FromPhoneNum>
         <sch:ToPhoneNum>
            <sch1:phoneType/>
            <sch1:phone>$!{headers.toPhone}</sch1:phone>
         </sch:ToPhoneNum>
         #if(${headers.amt})
         <sch:amt>$!{headers.amt}</sch:amt>
         #end
         <sch:Device>
            <sch:hash>$!{headers.hash}</sch:hash>
            <sch:brand>$!{headers.brand}</sch:brand>
            <sch:country>$!{headers.country}</sch:country>
            <sch:city>$!{headers.city}</sch:city>
            <sch:model>$!{headers.model}</sch:model>
            <sch:imsi>$!{headers.imsi}</sch:imsi>
            <sch:geolocation>$!{headers.geolocation}</sch:geolocation>
            <sch:carrierName>$!{headers.carrierName}</sch:carrierName>
         </sch:Device>
      </sch:modTransferTransactionLogRq>
   </soapenv:Body>
</soapenv:Envelope>